site/protected/runtime/2016-10-24_10-18-41_000000_soap.log

Timestamp: 2016-10-24 10:18:41 +02:00 CEST
POST / HTTP/1.1
Host: test.webservices.amadeus.com
Connection: Keep-Alive
User-Agent: PHP-SOAP/5.6.23
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://webservices.amadeus.com/1ASIWBELBEL/ITAREQ_05_2_IA"
Content-Length: 2509

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://xml.amadeus.com/ITAREQ_05_2_IA" xmlns:ns2="http://xml.amadeus.com/ws/2009/01/WBS_Session-2.0.xsd"><SOAP-ENV:Header><ns2:Session><ns2:SessionId>00ZWRKUN6T</ns2:SessionId><ns2:SequenceNumber>2</ns2:SequenceNumber><ns2:SecurityToken>2B8287YFI6XS02HC2PMGLW0H5B</ns2:SecurityToken></ns2:Session></SOAP-ENV:Header><SOAP-ENV:Body><ns1:Air_SellFromRecommendation><ns1:messageActionDetails><ns1:messageFunctionDetails><ns1:messageFunction>183</ns1:messageFunction><ns1:additionalMessageFunction>M1</ns1:additionalMessageFunction></ns1:messageFunctionDetails></ns1:messageActionDetails><ns1:itineraryDetails><ns1:originDestinationDetails><ns1:origin>DEL</ns1:origin><ns1:destination>BOM</ns1:destination></ns1:originDestinationDetails><ns1:message><ns1:messageFunctionDetails><ns1:messageFunction>183</ns1:messageFunction></ns1:messageFunctionDetails></ns1:message><ns1:segmentInformation><ns1:travelProductInformation><ns1:flightDate><ns1:departureDate>131017</ns1:departureDate></ns1:flightDate><ns1:boardPointDetails><ns1:trueLocationId>DEL</ns1:trueLocationId></ns1:boardPointDetails><ns1:offpointDetails><ns1:trueLocationId>CMB</ns1:trueLocationId></ns1:offpointDetails><ns1:companyDetails><ns1:marketingCompany>UL</ns1:marketingCompany></ns1:companyDetails><ns1:flightIdentification><ns1:flightNumber>196</ns1:flightNumber><ns1:bookingClass>O</ns1:bookingClass></ns1:flightIdentification></ns1:travelProductInformation><ns1:relatedproductInformation><ns1:quantity>1</ns1:quantity><ns1:statusCode>NN</ns1:statusCode></ns1:relatedproductInformation></ns1:segmentInformation><ns1:segmentInformation><ns1:travelProductInformation><ns1:flightDate><ns1:departureDate>131017</ns1:departureDate></ns1:flightDate><ns1:boardPointDetails><ns1:trueLocationId>CMB</ns1:trueLocationId></ns1:boardPointDetails><ns1:offpointDetails><ns1:trueLocationId>BOM</ns1:trueLocationId></ns1:offpointDetails><ns1:companyDetails><ns1:marketingCompany>UL</ns1:marketingCompany></ns1:companyDetails><ns1:flightIdentification><ns1:flightNumber>141</ns1:flightNumber><ns1:bookingClass>Q</ns1:bookingClass></ns1:flightIdentification></ns1:travelProductInformation><ns1:relatedproductInformation><ns1:quantity>1</ns1:quantity><ns1:statusCode>NN</ns1:statusCode></ns1:relatedproductInformation></ns1:segmentInformation></ns1:itineraryDetails></ns1:Air_SellFromRecommendation></SOAP-ENV:Body></SOAP-ENV:Envelope>
HTTP/1.1 200 OK
Content-Encoding: gzip
Content-Type: text/xml
Content-Length: 690
<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header xmlns="http://xml.amadeus.com/ws/2009/01/WBS_Session-2.0.xsd"><Session><SessionId>00ZWRKUN6T</SessionId><SequenceNumber>2</SequenceNumber><SecurityToken>2B8287YFI6XS02HC2PMGLW0H5B</SecurityToken></Session></soap:Header><soap:Body><Air_SellFromRecommendationReply xmlns="http://xml.amadeus.com/ITARES_05_2_IA"><message><messageFunctionDetails><messageFunction>183</messageFunction></messageFunctionDetails></message><errorAtMessageLevel><errorSegment><errorDetails><errorCode>288</errorCode><errorCategory>EC</errorCategory></errorDetails></errorSegment></errorAtMessageLevel><itineraryDetails><originDestination><origin>DEL</origin><destination>BOM</destination></originDestination><segmentInformation><flightDetails><flightDate><departureDate>131017</departureDate><departureTime>0000</departureTime><arrivalTime>0000</arrivalTime></flightDate><boardPointDetails><trueLocationId>DEL</trueLocationId></boardPointDetails><offpointDetails><trueLocationId>CMB</trueLocationId></offpointDetails><companyDetails><marketingCompany>UL</marketingCompany></companyDetails><flightIdentification><flightNumber>196</flightNumber><bookingClass>O</bookingClass></flightIdentification><flightTypeDetails><flightIndicator>EN</flightIndicator></flightTypeDetails><specialSegment>P</specialSegment></flightDetails><actionDetails><quantity>1</quantity><statusCode>UNS</statusCode></actionDetails></segmentInformation><segmentInformation><flightDetails><flightDate><departureDate>131017</departureDate><departureTime>0000</departureTime><arrivalTime>0000</arrivalTime></flightDate><boardPointDetails><trueLocationId>CMB</trueLocationId></boardPointDetails><offpointDetails><trueLocationId>BOM</trueLocationId></offpointDetails><companyDetails><marketingCompany>UL</marketingCompany></companyDetails><flightIdentification><flightNumber>141</flightNumber><bookingClass>Q</bookingClass></flightIdentification><flightTypeDetails><flightIndicator>EN</flightIndicator></flightTypeDetails><specialSegment>P</specialSegment></flightDetails><actionDetails><quantity>1</quantity><statusCode>UNS</statusCode></actionDetails></segmentInformation></itineraryDetails></Air_SellFromRecommendationReply></soap:Body></soap:Envelope>